Revit 2024 API
AdvancedWood.WoodRayEllipseZ2x Property
 The property labeled "Ratio between two radii of ray ellipse" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WoodRayEllipseZ2x { get; }
Visual Basic
Public Shared ReadOnly Property WoodRayEllipseZ2x As String
	Get
Visual C++
public:
static property String^ WoodRayEllipseZ2x {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble".
See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace